[
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Sistema de información",
    "definicion": "Cualquier herramienta o conjunto de ellas que permitan almacenar y gestionar los datos de interés para una determinada organización, con el fin de dar soporte a la operación cotidiana de esta."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Elementos de un sistema de información",
    "definicion": "1. Datos: información que se almacena y gestiona. 2. Recursos físicos: Carpetas, documentos, equipamiento, discos... 3. Recursos humanos: Personal que maneja la información. 4. Protocolo: Normas que debe cumplir la información para ser manejada."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Sistema orientados a proceso",
    "definicion": "Sistema en el que los elementos de información se tratan de manera completamente independiente, lo que da lugar a que sus almacenes de datos, archivos o ficheros, se mantengan separados aunque contengan elementos comunes. Los datos terminan replicándose causando incoherencias e inconsistencias de la información. Cada uno de los programas o procesos utiliza sus propios datos y se encarga también de almacenarlos."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Inconvenientes de los sistemas orientados a proceso",
    "definicion": "1. Más difícil gestionar la seguridad. 2. Datos inconsistentes. 3. Coste del almacenamiento. 4. Datos redundantes. 5. Dificultad para acceder a los datos si es una consulta no prevista en uno de los programas."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Ventaja de los sistemas orientados a proceso",
    "definicion": "Cada proceso es independiente lo que significa que si modificamos uno no afecta a los otros."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Sistema orientados a datos",
    "definicion": "Sistema en el que existe un repositorio común de información compartido por todas las aplicaciones. Los datos se almacenan en esa base de datos y todas las aplicaciones acceden a los mismos datos. Si son modificados por una aplicación, dichos cambios quedan también para el resto de aplicaciones."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Inconvenientes de los sistemas orientados a datos",
    "definicion": "1. La implantación es más larga. 2. La instalación es más costosa. 3. Escasa estandarización."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Ventajas de los sistemas orientados a datos",
    "definicion": "1. El acceso a los datos es más eficaz. 2. Hay mayor independencia entre los datos, los programas y los procesos. 3. Menor redundancia. 4. Hay más información sobre los datos."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Archivos",
    "definicion": "Son elementos de carácter lógico que nos ofrece el sistema operativo. Contienen datos que guardan algún tipo de relación o forman parte de una misma unidad de información (un documento, una imagen, etc.). El formato y el tipo de archivo determina la forma de manipular la información que almacena."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "RAM",
    "definicion": "Es la memoria principal del sistema, que resulta directamente accesible al procesador. La información contenida en el resto de sistemas de almacenamiento (memoria secundaria) tiene que ser cargada primero en RAM antes de poder ser accedida."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Clasificación de ficheros",
    "definicion": "1. Según su contenido (texto o binario). 2. Según su organización (secuencial, directa o indexada). 3. Según su utilidad (maestros, históricos, movimientos)."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Base de datos",
    "definicion": "Es un conjunto de datos sin repetición de la información y con una estructura que refleja la organización de los elementos representados. Los datos pertenecen a un mismo contexto (o problema) y están almacenados sistemáticamente para su posterior uso."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Características de una base de datos",
    "definicion": "1. Independencia con respecto a los programas y aplicaciones que hagan uso de los datos. 2. Posibilidad de compartición y acceso concurrente a la información. 3. Contienen metadatos o información sobre los propios datos."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Nivel de usuario o nivel externo",
    "definicion": "Es la visión que tiene de la base de datos cada usuario particular. En este nivel se reflejan las relaciones y datos de interés para cada usuario particular por lo que existirán tantos esquemas externos como aplicaciones que hagan uso de los datos."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Nivel conceptual",
    "definicion": "Describe todos los datos de interés para la organización, las asociaciones entre ellos y sus requerimientos en materia de seguridad, independientemente de las aplicaciones, usuarios y el ssggbbdd que se vaya a utilizar (ej. modelo entidad-relación)."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Nivel interno",
    "definicion": "Corresponde al esquema que describe la forma en los datos que se representan de manera lógica y también como se organizan para su almacenamiento físico (ej. modelo dee bbdd relacional)."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Esquema de una base de datos",
    "definicion": "Describe su estructura en términos de elementos y organización."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Lenguaje Unificado de Modelado (UML)",
    "definicion": "Es un lenguaje gráfico para representar partes de un sistema."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Componentes de una base de datos",
    "definicion": "1. Dato. 2. Tipo de dato. 3. Campo (Columna). 4.Registro (Fila). 5. Campo Clave. 6. Tabla. 7. Consulta. 8. Índice. 9. Vista. 10. Informe. 11. Guiones. 12. Procedimientos."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": "Dato",
    "definicion": " ."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": " ",
    "definicion": " ."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": " ",
    "definicion": " ."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": " ",
    "definicion": " ."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": " ",
    "definicion": " ."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": " ",
    "definicion": " ."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": " ",
    "definicion": " ."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": " ",
    "definicion": " ."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": " ",
    "definicion": " ."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": " ",
    "definicion": " ."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": " ",
    "definicion": " ."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": " ",
    "definicion": " ."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": " ",
    "definicion": " ."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": " ",
    "definicion": " ."
  },
  {
    "asignatura": "Bases de datos",
    "unidad": "1",
    "concepto": " ",
    "definicion": " ."
  }
]
